{"timestamp": 1744006890.1458118, "data": {"brand": "example", "articles": [{"url": "https://www.pna.gov.ph/articles/1236789", "title": "PH caps ‘milestone’ confab on women, vows to take lead | Philippine News Agency", "content": "In observance of the Holy Week, the Philippine News Agency’s online news service will be off on April 18, \r\nGood Friday, and April 19, Black Saturday. Normal operations will resume on April 20, \r\nEaster Sunday. — The Editors By Joyce Ann L. Rocamora \n\n\nOctober 31, 2024, 8:06 am\n                                             \n Share Foreign Affairs Secretary Enrique Manalo (PNA photo by Avito Dalan) MANILA – The Philippines capped the first International Conference on Women, Peace, and Security (IC", "relevance": "Yes, it is relevant"}, {"url": "https://www.rappler.com/philippines/national-news/", "title": "National news in the Philippines", "content": "Breaking stories on current events, the latest on movers and shakers in the Philippines. The anti-graft court says the former Bureau of Customs commissioner failed to present 'compelling reasons' in his bid to throw out the graft charges against him follow us     ", "relevance": "Yes, it is relevant"}, {"url": "https://www.philstar.com/headlines/2024/06/17/2363511/facebook-other-traditional-socmed-platforms-wane-news-sources-ph-digital-news-report-2024", "title": "Facebook, other traditional socmed platforms wane as news sources in PH — Digital News Report 2024 | Philstar.com", "content": "Adult Filipinos are relying less on Facebook and other legacy social media platforms for news, increasingly turning to video-centric TikTok amid changing news consumption habits. The trend mirrors the global decline in traditional social media usage for news as detailed in the Reuters Institute Digital News Report (DNR) released on June 17. This year’s report also highlights the rising popularity of short news videos, diminishing prominence of mainstream news media and journalists on many social", "relevance": "Yes, it is relevant"}, {"url": "https://www.pna.gov.ph/articles/1239238", "title": "Tougher penalties for misogyny, homophobia by public officials eyed | Philippine News Agency", "content": "In observance of the Holy Week, the Philippine News Agency’s online news service will be off on April 18, \r\nGood Friday, and April 19, Black Saturday. Normal operations will resume on April 20, \r\nEaster Sunday. — The Editors By Filane Mikee Cervantes \n\n\nDecember 3, 2024, 7:30 pm\n                                                Updated on December 3, 2024, 8:53 pm\n\n Share TOUGHER PENALTIES. House of Representatives Committee on Women and Gender Equality chair, Bataan Rep. Geraldine Roman, answers ", "relevance": "Yes, it is relevant"}, {"url": "https://www.sunstar.com.ph/davao/local-news/lead-by-example-pnp-chief-tells-police", "title": "Lead by example, PNP chief tells police", "content": "Philippine National Police Chief Benjamin Acorda Jr. urged the police to lead by example and place respect in all their actions. “Lead by example, demonstrating respect in everything we do,” Acorda said during the 122nd Police Service Anniversary where he visited police Camp Vicente Lim in Calamba, Laguna. By doing so, he added, the police would be able to “inspire respect in others and foster unity and understanding in your communities”. “So, carry that respect in your heart. It is the key to b", "relevance": "Yes, it is relevant"}, {"url": "https://www.pids.gov.ph/details/fake-news-poses-greater-threat-to-public-health-amid-the-pandemic", "title": "PIDS - Philippine Institute for Development Studies", "content": "Guidelines in Preparation of Articles Editorial Board List of All Issues Disclaimer and Permissions Inquiries and Submissions Subscription Working Papers Monograph Series Staff Papers Economic Outlook Series List of All Archived Publications Database Updates \n\n\n  Working Papers Monograph Series Staff Papers Economic Outlook Series List of All Archived Publications", "relevance": "Yes, it is relevant"}, {"url": "https://www.pna.gov.ph/articles/1227756", "title": "National gastronomy tourism plan to showcase unique Filipino dishes | Philippine News Agency", "content": "In observance of the Holy Week, the Philippine News Agency’s online news service will be off on April 18, \r\nGood Friday, and April 19, Black Saturday. Normal operations will resume on April 20, \r\nEaster Sunday. — The Editors By Joyce Ann L. Rocamora \n\n\nJune 26, 2024, 8:24 pm\n                                             \n Share FOOD TOURISM. Secretary Christina Frasco (right) and DOT Caraga Region Director Dumadag (2nd from right) visit the Caraga Region's booth during the UN Tourism Gastronomy F", "relevance": "Yes, it is relevant"}, {"url": "https://www.rappler.com/philippines/philippine-news-sites-moderate-disinformation-risk-global-disinformation-index/", "title": "Philippine news sites score moderate disinformation risk level", "content": " SUMMARY This is AI generated summarization, which may have errors. For context, always refer to the full article. MANILA, Philippines – Philippine news sites collectively scored a “moderate level of disinformation risk” in the newly launched Philippine report of the UK-based not for profit Global Disinformation Index (GDI).  Released on Wednesday, February 15, the index examined a total of 35 “influential and widely read news sites” in the Philippines in written English, Tagalog, and Cebuano. C", "relevance": "Yes, it is relevant"}]}}