{"timestamp": 1744006923.332178, "data": {"brand": "Mister Donut", "articles": [{"url": "https://www.pna.gov.ph/articles/1125251", "title": "Mister Donut offers 90-day business trial franchise package | Philippine News Agency", "content": "In observance of the Holy Week, the Philippine News Agency’s online news service will be off on April 18, \r\nGood Friday, and April 19, Black Saturday. Normal operations will resume on April 20, \r\nEaster Sunday. — The Editors \n\n\nDecember 19, 2020, 4:33 pm\n                                             \n Share MANILA – Mister Donut has launched a franchising scheme that gives franchisees a 90-day trial to test if their store locations will be profitable or not. Mister Donut’s “Business Trial Package", "relevance": "Yes, it is relevant"}, {"url": "https://tribune.net.ph/2024/03/17/mister-donut-offers-90-day-business-trial-package", "title": "Mister Donut offers 90-day business trial package ", "content": "Mister Donut, a strong international brand with 40 years of proven franchising track record in the Philippines, is encouraging budding entrepreneurs or those who want to test the viability of a new location to pursue their franchising plans via its 90-day business trial package. This franchise package entails minimal risk as the initial investment is only P100,000 for a minimum 4-square meter indoor or inline kiosk, with half of the amount refundable. At the end of the trial period, Mister Donut", "relevance": "Yes, it is relevant"}, {"url": "https://www.bworldonline.com/corporate/2024/05/21/596356/kfc-targets-to-open-over-50-stores-in-phl-this-year/", "title": "KFC targets to open over 50 stores in PHL this year - BusinessWorld Online", "content": " RAMCAR Food Group’s KFC Philippines said it plans to open over 50 stores this year to bring the brand closer to more provincial markets. “In 2023, we ended with 382 stores, and we are bound to open more than 50 stores this year because our thrust is to bring KFC closer to our market,” said Charmaine Pamintuan, chief marketing officer of KFC, on the sidelines of the KFC Kentucky Town Music and Arts Festival on Saturday. “These will be located in the National Capital Region, and some will be open", "relevance": "No, it is not relevant"}, {"url": "https://www.philstar.com/business/2023/12/10/2317668/new-mister-donut-franchise-packages-convenience-stores-coffee-shops-launched", "title": "New Mister Donut franchise packages for convenience stores, coffee shops launched | Philstar.com", "content": "MANILA, Philippines — International brand Mister Donut has launched new franchising packages that will help existing convenience stores and coffee shops boost their product offerings at minimal investments. Mister Donut, which has been in the franchising business in the country for over 40 years now, recently rolled out the Convenience Store Package and Mini Package for Coffee Shops. The exclusive offer for owners of grocery and convenience stores only entails an investment of P110,000, which al", "relevance": "Yes, it is relevant"}, {"url": "https://palawan-news.com/mr-pluffy-now-in-puerto-princesa-bringing-joy-one-cotton-candy-at-a-time/", "title": "Mr. Pluffy now in Puerto Princesa, bringing joy one cotton candy at a time", "content": " The core memories of childhood always hold a special place in us as we grow up. One such memory is the enjoyment of cotton candy’s sweetness. Although it comes in various colors, it brings widespread joy to children, whether they are at church, taking a break from school, or playing in the park. In the Philippines, cotton candy holds a unique appeal, often seen as a symbol of simple pleasures and communal joy. Its popularity among Filipinos can be attributed to its delightful texture and the wa", "relevance": "No, it is not relevant"}, {"url": "https://www.pna.gov.ph/articles/1050360", "title": "DTI opens OTOP center in Zamboanga City | Philippine News Agency", "content": "In observance of the Holy Week, the Philippine News Agency’s online news service will be off on April 18, \r\nGood Friday, and April 19, Black Saturday. Normal operations will resume on April 20, \r\nEaster Sunday. — The Editors By R. G. Antonet Go \n\n\nOctober 8, 2018, 7:42 pm\n                                             \n Share  ZAMBOANGA CITY--Cielito “Honeylet” Avanceña on Monday encouraged the women sector to engage in business to empower themselves and have financial independence.Avanceña, Presi", "relevance": "No, it is not relevant"}, {"url": "https://tribune.net.ph/2024/03/20/franchise-asia-philippines-back-this-april", "title": "Franchise Asia Philippines Back this April", "content": "All is set for Franchise Asia Philippines 2024 Expo, Asia’s biggest franchise show and the country’s most awaited business opportunities event from 12 to 14 April at the SMX Convention Center Manila.  Organized by the Philippine Franchise Association, the premier event promises to be a platform for entrepreneurs and investors seeking lucrative franchise opportunities and valuable business insights. “Our show has always been in April,” explains PFA Chairman Chris Lim, “we just moved it to October", "relevance": "No, it is not relevant"}]}}