{"timestamp":1744083005582,"data":{"brand":"Uncle John","articles":[{"url":"https://www.philstar.com/business/2024/09/09/2383797/robinsons-targets-new-segments-it-ramps-acquisition-mode","title":"Robinsons targets new segments as it ramps up acquisition mode | Philstar.com","content":"MANILA, Philippines — Robinsons Retail Holdings Inc. (RRHI) is looking to diversify into new market segments with a number of brands currently on its add-to-cart list of potential acquisitions. RRHI COO Stanley Co told The STAR in an interview that the company is targeting to acquire new brands that would further diversify its current portfolio. “There are a few that we’re looking at but we are still not at liberty to divulge right now. From time to time we’re always looking for opportunities,” ","relevance":"Yes, it is relevant"},{"url":"https://www.philstar.com/opinion/2024/11/25/2402662/mass-transport","title":"Mass transport | Philstar.com","content":"Since Nov. 16, employees of The STAR living in northern Metro Manila have enjoyed easier travel to the office. The reason: the start of operations of the Light Rail Transit-1 Cavite Extension Phase 1, which extended LRT services from the Redemptorist-Aseana station in Baclaran, Parañaque to Dr. Santos (Sucat) in the same city, with three stops in between: MIA Road, PITX and Ninoy Aquino Avenue. The Dr. Santos station is near our office building. End-to-end travel time is down to 50 minutes – a h","relevance":"No, it is not relevant"},{"url":"https://tribune.net.ph/2022/09/23/hello-uncle-johns","title":"Hello, Uncle John’s","content":"Ministop stores in the Philippines will soon be called Uncle John's, operator Robinsons Convenience Stores Inc said in statement. The new name refers to the chain's best-selling product, Uncle John's Fried Chicken. Early this year, Robinsons Retail Holdings announced it has acquired Ministop Japan's 40-percent stake in Robinsons Convenience Stores. RCSI now holds 100 percent of the store chain in the country. \"Uncle John's has become a household name for consumers on-the-go, looking for convenie","relevance":"Yes, it is relevant"},{"url":"https://www.rappler.com/business/robinsons-retail-says-uncle-john-fried-chicken-to-stay-ministop-japan-exit-philippines/","title":"Uncle John’s Fried Chicken to stay after Ministop Japan's exit from PH – Robinsons","content":"Already have Rappler+? Sign in to listen to groundbreaking journalism. SUMMARY This is AI generated summarization, which may have errors. For context, always refer to the full article. \n\t\t\t\t\t\tMinistop Philippines' Facebook page\t\t\t\t\t MANILA, Philippines – Fans of Uncle John’s Fried Chicken need not worry that it too will leave the Philippines, following the news of Japanese company Ministop divesting from the country. In a statement on Monday, January 24, Gokongwei-led Robinsons Retail Holdings I","relevance":"Yes, it is relevant"},{"url":"https://mindanaotimes.com.ph/bank-where-you-shop-with-gotyme-bank-and-uncle-johns/","title":"Bank Where You Shop With GoTyme Bank and Uncle John’s","content":"\nGoTyme Bank makes good on its promise of bringing easy, preferred banking to its customers with a partnership with convenience store chain Uncle John’s. The partnership expands the bank’s deposit and withdrawal footprint just as it hits the 1 millionth customer mark within less than a year. Once again going the extra mile, the bank offers its users a leveled-up banking experience that was once limited to the top 5% of the country. Now, it’s not only possible to manage finances via the GoTyme Ba","relevance":"No, it is not relevant"},{"url":"https://malaya.com.ph/business/business-news/ph-private-label-grocery-sales-to-hit-896m-in-2025-usda-report/","title":"PH private label grocery sales to hit $896M in 2025 — USDA report - Malaya Business Insight","content":"The country’s private label grocery market is projected to reach $896 million this year, according to a report by the USDA-Foreign Agricultural Service (FAS) Manila. Private label products accounted for 7 percent of total food and beverage (F&B) grocery sales in the Philippines. Total F&B grocery sales are projected to reach $12.8 billion in the Philippines this year, a 5 percent year-on-year increase, FAS Manila office said in a report dated Jan. 15. “This growth is expected to continue at a co","relevance":"No, it is not relevant"},{"url":"https://www.pna.gov.ph/articles/1083985","title":"GrabFood kicks off operations in Bacolod City | Philippine News Agency","content":"In observance of the Holy Week, the Philippine News Agency’s online news service will be off on April 18, \nGood Friday, and April 19, Black Saturday. Normal operations will resume on April 20, \nEaster Sunday. — The Editors By Nanette Guadalquiver \n                     \n                     \n                        October 23, 2019, 4:00 pm\n                                             \n                   Share FOOD DELIVERY SERVICE. GrabFood, one of the features of popular mobile application Grab","relevance":"No, it is not relevant"},{"url":"https://www.philstar.com/business/2024/07/27/2373200/rrhi-gears-greater-heights-gokongwei-pe-passes-torch-co","title":"RRHI gears up for greater heights; Gokongwei-Pe passes torch to Co | Philstar.com","content":"MANILA, Philippines — Robinsons Retail Holdings Inc. (RRHI) is gearing up for greater heights as it undertakes organizational changes, with president and CEO Robina Gokongwei-Pe passing the torch to Stanley Co, a seasoned company executive. Gokongwei-Pe, who was first appointed president and COO in 1997 and who has been president and CEO of RRHI since 2018, will transition to the role of chairman effective Jan. 1, 2025. She will replace her brother, Lance Gokongwei, who will step down as chairma","relevance":"Yes, it is relevant"}]}}